In [12]:
import pandas as pd
import numpy as np

In [41]:
dic={
    'firstnum':[1,2],
     "sectnum":[44,55],
    "thirdtnum":[23,33]
}

In [42]:
d=pd.DataFrame(dic)

In [43]:
d.median()

firstnum      1.5
sectnum      49.5
thirdtnum    28.0
dtype: float64

In [44]:
d.std()

firstnum     0.707107
sectnum      7.778175
thirdtnum    7.071068
dtype: float64

In [45]:
d.count()

firstnum     2
sectnum      2
thirdtnum    2
dtype: int64

In [46]:
d.min()

firstnum      1
sectnum      44
thirdtnum    23
dtype: int64

In [47]:
d.max()

firstnum      2
sectnum      55
thirdtnum    33
dtype: int64

In [48]:
d.corr()

           firstnum  sectnum  thirdtnum
firstnum        1.0      1.0        1.0
sectnum         1.0      1.0        1.0
thirdtnum       1.0      1.0        1.0

In [49]:
data=pd.read_excel('ss.xlsx')

In [50]:
data

     Name   Id   Marks  Semester
0  Zeeshan    1    NaN         3
1   Aneela    2    NaN         9
2   Shahid    3    NaN         9
3   Aliyan    4    NaN         0

In [52]:
data.reset_index(inplace=True)

In [54]:
data.describe()

          index       Id   Marks  Semester
count  4.000000  4.000000    0.0      4.00
mean   1.500000  2.500000    NaN      5.25
std    1.290994  1.290994    NaN      4.50
min    0.000000  1.000000    NaN      0.00
25%    0.750000  1.750000    NaN      2.25
50%    1.500000  2.500000    NaN      6.00
75%    2.250000  3.250000    NaN      9.00
max    3.000000  4.000000    NaN      9.00